##
# Запустить/пересоздать контейнеры из образов проекта
#
# Пример запуска: make up
up:
	docker-compose up -d

##
# Удалить контейнеры, их неименованные вольюмы, сети проекта
#
# Пример запуска: make down
down:
	docker-compose down -v

##
# Сборка всех образов проекта с опцией принудительного обновления базовых образов
#
# Пример запуска: make build
build:
	docker-compose build --pull --no-cache --parallel

##
# Сборка конкретного образа по названию сервиса с опцией принудительного обновления базовых образов
#
# Пример запуска: make build-nginx
build-%:
	docker-compose build --pull --no-cache $*

##
# Запуск оболочки bash внутри запущенного контейнера по названию сервиса
# Сработает только если внутри контейнера установлен bash
#
# Пример запуска: make bash-php
bash-%:
	docker-compose exec $* /bin/sh
